; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=320, out_folder=./training, instance_id=20, seed=2044, goal_proportion=0.03

(define (problem blocksworld-20)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 b319 b320 - object)
 (:init 
    (arm-empty)
    (clear b225)
    (on b225 b268)
    (on-table b268)
    (clear b11)
    (on-table b11)
    (clear b55)
    (on-table b55)
    (clear b112)
    (on b112 b111)
    (on b111 b189)
    (on b189 b172)
    (on-table b172)
    (clear b151)
    (on-table b151)
    (clear b234)
    (on-table b234)
    (clear b50)
    (on-table b50)
    (clear b40)
    (on b40 b231)
    (on b231 b272)
    (on b272 b100)
    (on-table b100)
    (clear b108)
    (on b108 b197)
    (on b197 b170)
    (on b170 b27)
    (on b27 b90)
    (on-table b90)
    (clear b49)
    (on-table b49)
    (clear b23)
    (on-table b23)
    (clear b296)
    (on b296 b207)
    (on b207 b174)
    (on b174 b229)
    (on-table b229)
    (clear b57)
    (on b57 b92)
    (on-table b92)
    (clear b19)
    (on b19 b115)
    (on b115 b251)
    (on-table b251)
    (clear b309)
    (on b309 b219)
    (on b219 b312)
    (on-table b312)
    (clear b165)
    (on-table b165)
    (clear b293)
    (on b293 b102)
    (on-table b102)
    (clear b201)
    (on b201 b252)
    (on b252 b243)
    (on b243 b39)
    (on b39 b315)
    (on b315 b156)
    (on-table b156)
    (clear b154)
    (on-table b154)
    (clear b133)
    (on b133 b274)
    (on b274 b47)
    (on b47 b265)
    (on-table b265)
    (clear b15)
    (on b15 b85)
    (on b85 b65)
    (on b65 b222)
    (on b222 b36)
    (on b36 b262)
    (on b262 b147)
    (on-table b147)
    (clear b106)
    (on-table b106)
    (clear b263)
    (on-table b263)
    (clear b54)
    (on-table b54)
    (clear b93)
    (on b93 b32)
    (on b32 b109)
    (on-table b109)
    (clear b308)
    (on b308 b99)
    (on b99 b140)
    (on b140 b16)
    (on b16 b194)
    (on b194 b14)
    (on-table b14)
    (clear b205)
    (on b205 b287)
    (on-table b287)
    (clear b119)
    (on-table b119)
    (clear b41)
    (on b41 b163)
    (on b163 b302)
    (on b302 b71)
    (on b71 b72)
    (on-table b72)
    (clear b161)
    (on b161 b218)
    (on b218 b74)
    (on-table b74)
    (clear b46)
    (on-table b46)
    (clear b190)
    (on b190 b143)
    (on-table b143)
    (clear b260)
    (on b260 b203)
    (on b203 b169)
    (on b169 b259)
    (on b259 b29)
    (on b29 b176)
    (on b176 b70)
    (on-table b70)
    (clear b253)
    (on b253 b67)
    (on-table b67)
    (clear b51)
    (on b51 b306)
    (on b306 b142)
    (on b142 b250)
    (on b250 b144)
    (on b144 b179)
    (on b179 b188)
    (on-table b188)
    (clear b118)
    (on b118 b66)
    (on b66 b310)
    (on-table b310)
    (clear b136)
    (on-table b136)
    (clear b192)
    (on b192 b277)
    (on b277 b75)
    (on b75 b60)
    (on b60 b199)
    (on-table b199)
    (clear b123)
    (on b123 b223)
    (on b223 b196)
    (on-table b196)
    (clear b141)
    (on b141 b8)
    (on b8 b288)
    (on b288 b124)
    (on b124 b182)
    (on b182 b276)
    (on-table b276)
    (clear b278)
    (on-table b278)
    (clear b281)
    (on b281 b73)
    (on b73 b294)
    (on-table b294)
    (clear b292)
    (on b292 b244)
    (on-table b244)
    (clear b79)
    (on-table b79)
    (clear b110)
    (on b110 b105)
    (on b105 b177)
    (on b177 b185)
    (on-table b185)
    (clear b117)
    (on b117 b216)
    (on b216 b261)
    (on b261 b168)
    (on b168 b83)
    (on b83 b242)
    (on b242 b48)
    (on b48 b209)
    (on b209 b313)
    (on b313 b149)
    (on b149 b120)
    (on b120 b153)
    (on-table b153)
    (clear b285)
    (on b285 b284)
    (on b284 b146)
    (on b146 b215)
    (on b215 b158)
    (on-table b158)
    (clear b280)
    (on b280 b193)
    (on b193 b319)
    (on b319 b5)
    (on b5 b137)
    (on b137 b17)
    (on b17 b34)
    (on b34 b131)
    (on b131 b53)
    (on b53 b283)
    (on-table b283)
    (clear b12)
    (on b12 b180)
    (on-table b180)
    (clear b4)
    (on b4 b183)
    (on b183 b37)
    (on b37 b228)
    (on b228 b271)
    (on b271 b68)
    (on-table b68)
    (clear b82)
    (on-table b82)
    (clear b152)
    (on b152 b21)
    (on-table b21)
    (clear b224)
    (on b224 b125)
    (on b125 b210)
    (on-table b210)
    (clear b22)
    (on b22 b132)
    (on-table b132)
    (clear b246)
    (on b246 b214)
    (on b214 b80)
    (on-table b80)
    (clear b139)
    (on-table b139)
    (clear b155)
    (on b155 b282)
    (on b282 b126)
    (on b126 b162)
    (on b162 b195)
    (on-table b195)
    (clear b157)
    (on b157 b121)
    (on b121 b291)
    (on b291 b266)
    (on b266 b164)
    (on-table b164)
    (clear b84)
    (on-table b84)
    (clear b300)
    (on b300 b78)
    (on b78 b91)
    (on b91 b69)
    (on b69 b230)
    (on b230 b233)
    (on b233 b128)
    (on b128 b113)
    (on b113 b298)
    (on b298 b320)
    (on b320 b255)
    (on-table b255)
    (clear b316)
    (on b316 b240)
    (on b240 b18)
    (on b18 b61)
    (on-table b61)
    (clear b107)
    (on-table b107)
    (clear b63)
    (on-table b63)
    (clear b26)
    (on b26 b101)
    (on b101 b202)
    (on b202 b213)
    (on b213 b318)
    (on-table b318)
    (clear b160)
    (on b160 b28)
    (on b28 b295)
    (on-table b295)
    (clear b35)
    (on-table b35)
    (clear b227)
    (on b227 b289)
    (on-table b289)
    (clear b9)
    (on b9 b116)
    (on-table b116)
    (clear b45)
    (on b45 b275)
    (on-table b275)
    (clear b247)
    (on b247 b59)
    (on b59 b148)
    (on b148 b103)
    (on-table b103)
    (clear b212)
    (on b212 b217)
    (on b217 b81)
    (on b81 b150)
    (on b150 b211)
    (on b211 b206)
    (on b206 b43)
    (on b43 b122)
    (on b122 b135)
    (on b135 b248)
    (on b248 b89)
    (on-table b89)
    (clear b186)
    (on b186 b175)
    (on b175 b86)
    (on-table b86)
    (clear b269)
    (on b269 b279)
    (on-table b279)
    (clear b1)
    (on b1 b198)
    (on b198 b239)
    (on b239 b299)
    (on b299 b305)
    (on-table b305)
    (clear b241)
    (on b241 b96)
    (on b96 b171)
    (on b171 b184)
    (on b184 b77)
    (on-table b77)
    (clear b286)
    (on-table b286)
    (clear b3)
    (on-table b3)
    (clear b13)
    (on-table b13)
    (clear b145)
    (on b145 b88)
    (on b88 b167)
    (on b167 b221)
    (on-table b221)
    (clear b181)
    (on b181 b87)
    (on-table b87)
    (clear b76)
    (on b76 b249)
    (on b249 b236)
    (on b236 b20)
    (on b20 b220)
    (on-table b220)
    (clear b104)
    (on-table b104)
    (clear b44)
    (on b44 b7)
    (on b7 b24)
    (on b24 b303)
    (on b303 b114)
    (on-table b114)
    (clear b95)
    (on-table b95)
    (clear b94)
    (on b94 b297)
    (on b297 b232)
    (on b232 b264)
    (on-table b264)
    (clear b237)
    (on-table b237)
    (clear b307)
    (on b307 b38)
    (on b38 b52)
    (on b52 b58)
    (on b58 b304)
    (on b304 b42)
    (on b42 b10)
    (on-table b10)
    (clear b173)
    (on b173 b311)
    (on-table b311)
    (clear b2)
    (on b2 b138)
    (on b138 b314)
    (on b314 b187)
    (on b187 b301)
    (on b301 b178)
    (on b178 b258)
    (on b258 b31)
    (on b31 b254)
    (on b254 b317)
    (on b317 b30)
    (on b30 b191)
    (on-table b191)
    (clear b129)
    (on b129 b6)
    (on b6 b200)
    (on b200 b127)
    (on b127 b130)
    (on b130 b226)
    (on b226 b245)
    (on b245 b159)
    (on b159 b235)
    (on-table b235)
    (clear b97)
    (on b97 b290)
    (on b290 b273)
    (on b273 b98)
    (on b98 b208)
    (on b208 b238)
    (on b238 b257)
    (on-table b257)
    (clear b33)
    (on b33 b204)
    (on b204 b62)
    (on b62 b25)
    (on b25 b270)
    (on b270 b256)
    (on-table b256)
    (clear b134)
    (on b134 b267)
    (on-table b267)
    (clear b56)
    (on b56 b166)
    (on b166 b64)
    (on-table b64))
 (:goal  (and 
    (clear b3)
    (on b3 b9)
    (on b9 b2)
    (on-table b2)
    (clear b4)
    (on b4 b5)
    (on-table b5)
    (clear b1)
    (on b1 b8)
    (on-table b8)
    (clear b6)
    (on b6 b7)
    (on-table b7))))

; plan
1. (unstack b2 b138)
   deleted: (on b2 b138) (clear b2) (arm-empty)
   added: (holding b2) (clear b138)
   goals met: 3 of 13
2. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 4 of 13
3. (unstack b129 b6)
   deleted: (on b129 b6) (clear b129) (arm-empty)
   added: (holding b129) (clear b6)
   goals met: 5 of 13
4. (putdown b129)
   deleted: (holding b129)
   added: (clear b129) (arm-empty) (on-table b129)
   goals met: 5 of 13
5. (unstack b141 b8)
   deleted: (on b141 b8) (clear b141) (arm-empty)
   added: (holding b141) (clear b8)
   goals met: 5 of 13
6. (putdown b141)
   deleted: (holding b141)
   added: (clear b141) (arm-empty) (on-table b141)
   goals met: 5 of 13
7. (unstack b8 b288)
   deleted: (on b8 b288) (clear b8) (arm-empty)
   added: (holding b8) (clear b288)
   goals met: 5 of 13
8. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 6 of 13
9. (unstack b280 b193)
   deleted: (on b280 b193) (clear b280) (arm-empty)
   added: (holding b280) (clear b193)
   goals met: 6 of 13
10. (putdown b280)
   deleted: (holding b280)
   added: (clear b280) (arm-empty) (on-table b280)
   goals met: 6 of 13
11. (unstack b193 b319)
   deleted: (on b193 b319) (clear b193) (arm-empty)
   added: (holding b193) (clear b319)
   goals met: 6 of 13
12. (putdown b193)
   deleted: (holding b193)
   added: (clear b193) (arm-empty) (on-table b193)
   goals met: 6 of 13
13. (unstack b319 b5)
   deleted: (on b319 b5) (clear b319) (arm-empty)
   added: (holding b319) (clear b5)
   goals met: 6 of 13
14. (putdown b319)
   deleted: (holding b319)
   added: (clear b319) (arm-empty) (on-table b319)
   goals met: 6 of 13
15. (unstack b5 b137)
   deleted: (on b5 b137) (clear b5) (arm-empty)
   added: (holding b5) (clear b137)
   goals met: 6 of 13
16. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 7 of 13
17. (unstack b44 b7)
   deleted: (on b44 b7) (clear b44) (arm-empty)
   added: (holding b44) (clear b7)
   goals met: 7 of 13
18. (putdown b44)
   deleted: (holding b44)
   added: (clear b44) (arm-empty) (on-table b44)
   goals met: 7 of 13
19. (unstack b7 b24)
   deleted: (on b7 b24) (clear b7) (arm-empty)
   added: (holding b7) (clear b24)
   goals met: 7 of 13
20. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 8 of 13
21. (unstack b9 b116)
   deleted: (on b9 b116) (clear b9) (arm-empty)
   added: (holding b9) (clear b116)
   goals met: 8 of 13
22. (stack b9 b2)
   deleted: (clear b2) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b2)
   goals met: 9 of 13
23. (unstack b1 b198)
   deleted: (on b1 b198) (clear b1) (arm-empty)
   added: (holding b1) (clear b198)
   goals met: 8 of 13
24. (stack b1 b8)
   deleted: (clear b8) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b8)
   goals met: 10 of 13
25. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 9 of 13
26. (stack b3 b9)
   deleted: (clear b9) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b9)
   goals met: 11 of 13
27. (unstack b4 b183)
   deleted: (on b4 b183) (clear b4) (arm-empty)
   added: (holding b4) (clear b183)
   goals met: 10 of 13
28. (stack b4 b5)
   deleted: (clear b5) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b5)
   goals met: 12 of 13
29. (unstack b6 b200)
   deleted: (on b6 b200) (clear b6) (arm-empty)
   added: (holding b6) (clear b200)
   goals met: 11 of 13
30. (stack b6 b7)
   deleted: (clear b7) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b7)
   goals met: 13 of 13
